post/cpp-algorithm-learning-note.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-12-29 Sun 22:22 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>C++算法</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Kinney Zhang">
<!-- Google Analytics -->
<!-- End Google Analytics -->

<link rel="stylesheet" type="text/css" href="https://blog.geekinney.com/static/ostyle.css"/>
<link rel="stylesheet" type="text/css" href="https://blog.geekinney.com/static/ostyle2.css"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/9.10.0/styles/googlecode.min.css"/>
</head>
<body>

<div id="org-div-header">
<div class="toptitle">
<span href="/post/index.html">Geekinney Blog</span>
</div>
<div class="topnav">
<a href="/post/index.html"> Home </a>&nbsp;|&nbsp;
<a href="/post/bookmark.html"> 链接收藏 </a>  &nbsp;|&nbsp;
<a href="/post/videos-collection.html"> 视频收藏 </a>  &nbsp;|&nbsp;
<a href="https://github.com/Kinneyzhang"> Github </a>&nbsp;|&nbsp;
</div>
</div>
<div id="content">
<header>
<h1 class="title">C++算法</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb64bf64">1. 数据结构</a>
<ul>
<li><a href="#org7264b45">1.1. 树</a></li>
</ul>
</li>
</ul>
</div>
</nav>


<div id="outline-container-orgb64bf64" class="outline-2">
<h2 id="orgb64bf64"><span class="section-number-2">1</span> 数据结构</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org7264b45" class="outline-3">
<h3 id="org7264b45"><span class="section-number-3">1.1</span> 树</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<ul class="org-ul">
<li><a id="org882aed0"></a>思路<br>
<div class="outline-text-4" id="text-org882aed0">
<ul class="org-ul">
<li>四个参数：当前节点，待插入节点，待插入节点的值，待插入节点的位置；</li>
<li>待插入的节点已经存在，则根据每次相对上个节点的插入位置向下遍历；直至到达最终插入位置，节点不存，则创建节点。递归结束。</li>
<li>层次遍历：使用队列，队列不为空则循环，将左右节点依次写入队列，先进先出，实现层次遍历。</li>
<li>前序遍历：递归（根左右）；中序遍历：递归（左根右）；后序遍历：递归（左右根）</li>
</ul>
</div>
</li>

<li><a id="org4e402b3"></a>实现<br>
<div class="outline-text-4" id="text-org4e402b3">
<div class="col-auto">
<pre><code class="C++">#include&lt;iostream&gt;
#include&lt;list&gt;
using namespace std;

struct node {
    int val;
    node *left;
    node *right;
};

void CreateTree (node *curr, node *n, int x, char pos) {
    if (n != NULL) {
	char ch;
	cout &lt;&lt; "\nLeft or right of " &lt;&lt; n-&gt;val &lt;&lt; ":";
	cin &gt;&gt; ch;
	if (ch == 'l')
	    CreateTree(n, n-&gt;left, x, ch);
	else if (ch == 'r')
	    CreateTree(n, n-&gt;right, x, ch);
    }
    else {
	node *t = new node;
	t-&gt;val = x;
	t-&gt;left = NULL;
	t-&gt;right = NULL;
	if (pos == 'l') 
	    curr-&gt;left = t;
	else if (pos == 'r')
	    curr-&gt;right = t;
    }
}

// 先序遍历：根左右
void Pre (node *n) {
    if (n != NULL) {
	cout &lt;&lt; n-&gt;val &lt;&lt; " ";
	Pre(n-&gt;left);
	Pre(n-&gt;right);
    }
}

//中序遍历：左根右
void In (node *n) {
    if (n!= NULL) {
	In(n-&gt;left);
	cout &lt;&lt; n-&gt;val &lt;&lt; " ";
	In(n-&gt;right);
    }
}

// 后序遍历：左右根
void Post (node *n) {
    if(n!= NULL) {
	Post(n-&gt;left);
	Post(n-&gt;right);
	cout &lt;&lt; n-&gt;val &lt;&lt; " ";
    }
}

// 层次遍历
void BFT (node *n) {
    list&lt;node*&gt; queue;
    queue.push_back(n);
    while (!queue.empty()) {
	n = queue.front();
	cout &lt;&lt; n-&gt;val &lt;&lt; " ";
	queue.pop_front();

	if (n-&gt;left != NULL)
	    queue.push_back(n-&gt;left);
	if (n-&gt;right != NULL)
	    queue.push_back(n-&gt;right);
    }
}

int main () {
    int value;
    int ch;
    node *root = new node;
    cout &lt;&lt; "\nEnter the value of root node: ";
    cin &gt;&gt; value;
    root-&gt;val = value;
    root-&gt;left = NULL;
    root-&gt;right = NULL;

    do {
	cout &lt;&lt; "\n0. Quit";
	cout &lt;&lt; "\n1. Insert";
	cout &lt;&lt; "\n2. Preorder Depth First";
	cout &lt;&lt; "\n3. Inorder Depth First";
	cout &lt;&lt; "\n4. Postorder Depth First";
	cout &lt;&lt; "\n5. Breadth First";

	cout &lt;&lt; "\nEnter your choice: ";
	cin &gt;&gt; ch;
	switch (ch) {
	case 1:
	    int x;
	    char pos;
	    cout &lt;&lt; "\nEnter the value to be inserted: ";
	    cin &gt;&gt; x;
	    cout &lt;&lt; "\nleft or right of the root: ";
	    cin &gt;&gt; pos;
	    if (pos == 'l')
		CreateTree(root, root-&gt;left, x, pos);
	    else if (pos == 'r')
		CreateTree(root, root-&gt;right, x, pos);
	    else
		cout &lt;&lt; "\nInvalid input!";
	    break;
	case 2:
	    Pre(root);
	    break;
	case 3:
	    In(root);
	    break;
	case 4:
	    Post(root);
	    break;
	case 5:
	    BFT(root);
	    break;
	}
    }while (ch != 0);
}
</code></pre>
</div>
</div>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="disqus_thread"></div>
<script>
(function() { // DON'T EDIT BELOW THIS LINE
var d = document, s = d.createElement('script');
s.src = 'https://geekinney-blog.disqus.com/embed.js';
s.setAttribute('data-timestamp', +new Date());
(d.head || d.body).appendChild(s);
})();
</script>
<noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>

<p class="author">Author: Kinney Zhang (<a href="mailto:kinneyzhang666@gmail.com">kinneyzhang666@gmail.com</a>)</p>
<p class="date">Date: 2019-12-27</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
</div>
</body>
</html>
